Revit 2026 API

# PreviewControl Constructor

---

Constructs a preview control.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PreviewControl(
	Document document,
	ElementId viewId
)
```
```vb
Public Sub New (
	document As Document,
	viewId As ElementId
)
```
```cpp
public:
PreviewControl(
	Document^ document,
	ElementId^ viewId
)
```
```fsharp
new :
        document : Document *
        viewId : ElementId -> PreviewControl
```

#### Parameters

document Document
    The document.
viewId ElementId
    The view id want to browse in this control.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when dbDocument or viewId is . |
| ArgumentException | Thrown when the given document is a linked document or the given viewId is invalid or the view is a schedule or other non-graphical view such as schedule views or the project browser view. |
| InvalidOperationException | Thrown when there is an active preview control already. |

#### Reference

PreviewControl Class

Autodesk.Revit.UI Namespace